Тестовая_база_ERP_14/src/InformationRegisters/НастройкиРаспределения/НастройкиРаспределения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиРаспределения</name>
  <resources>
    <name>Настройка</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/НастройкиРаспределения/Forms/СохранитьНастройку/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Подразделение = Параметры.Подразделение;
	Документ = Параметры.Документ;
	СтатьяРасходов = Параметры.СтатьяРасходов;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьНастройку();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройку()
	
	МенеджерЗаписи = РегистрыСведений.НастройкиРаспределения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтатьяРасходов = СтатьяРасходов;
	МенеджерЗаписи.Организация = Организация;
	
	Если ИспользоватьДляПодразделения > 0 Тогда
		МенеджерЗаписи.Подразделение = Подразделение;
	КонецЕсли;
	
	МенеджерЗаписи.Настройка = Документ;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти
